Term4/discrete/lectures/2.tex
% Created 2021-02-17 Wed 15:52
% Intended LaTeX compiler: pdflatex
\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}

 \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\rank}{\text{rank}}
\newcommand{\const}{\text{const}}
\newcommand{\grad}{\text{grad}}

\theoremstyle{plain}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 2}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Лекция 2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode )}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Производящие функции}
\label{sec:org5823255}
\begin{definition}
\textbf{Полином} --- степенныой ряд, у которого начиная с некоторого места
 \(n\) все коэффиценты 0.
\end{definition}
\begin{symb}
\(\deg p = n\)
\end{symb}
\begin{definition}
\(\frac{P(t)}{Q(t)}\) --- \textbf{дробно рациональная функция}
\end{definition}
\subsection{Рекурентные соотношения}
\label{sec:org15f1a67}
\begin{definition}
\[ m: a_0, a_1, \dots, a_{m - 1} \]
\(k \le m, n \ge m\) \[ a_n = c_1a_{n-1} + \dots + a_ka_{n - k} \], где \(c_1, \dots, c_k\) --- коэффиценты рекурентности
\end{definition}
\begin{examp}
\-
\begin{itemize}
\item \(m = 2,\ k = 2\)
\item \(f_0 = f_1 = 1\)
\item \(c_1 = c_2 = 1\)
\end{itemize}
f\textsubscript{n} = f\textsubscript{n - 1} + f\textsubscript{n - 2} --- числа Фибоначи
\end{examp}


\begin{definition}
\textbf{Квазиполином}
\[ f(n) = \sum_{i = 1}^k p_i(n)r_i^n \], где \(p_i\) --- полином, \(r_i\) --- числа
\end{definition}
\begin{theorem}
\begin{itemize}
\item \(a_0, a_1, \dots, a_n, \dots\)
\end{itemize}
\uline{Тогда} эквивалентны:
\begin{enumerate}
\item \(A(t) = \frac{P(t)}{Q(t)}\), \(P, Q\) --- полиномы, \(q_0 \neq 0\)
\item для \(n \ge m\) \(a_n\) задается линейным рекурентным соотношением: \(a_n = c_1a_{n - 1} + \dots + c_ka_{n - k}\), причем:
\begin{itemize}
\item \(Q(t) = 1 - c_1t - c_2t^2 - \dots - c_kt^k\)
\item \(\deg P \le m - 1\)
\end{itemize}
\item \(a_n\) --- квазиполином \[ a_n = \sum_{i = 1}^k p_i(n)r_i^n \label{kvazi_1}\addtag \]
причем:
\begin{itemize}
\item \(r_i\) --- обратные величины корням \(Q(t)\)
\item \(k\) --- число различных его корней
\item \(\deg p_i = (\text{кратность корня}(r_i^{-1})) - 1\) \\
(\ref{kvazi_1} кроме \(\le m\) первых членов)
\end{itemize}
\end{enumerate}
\end{theorem}
\end{document}
